//
//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \|     |// '.
//                 / \|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \  -  /// |     |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永无BUG
//
//
//
#include <bits/stdc++.h>

using namespace std;

int main()
{
    int n, one, two;
    cin >> n >> one >> two;
    int two2one = 0;
    int sum = 0;
    for (int i = 0; i < n; i++)
    {
        int tmp;
        cin >> tmp;
        if (tmp == 1)
        {
            if (one > 0)
            {
                one--;
            }
            else if (two > 0)
            {
                two--;
                two2one++;
            }
            else if (two2one > 0)
            {
                two2one--;
            }
            else
            {
                sum++;
            }
        }
        if (tmp == 2)
        {
            if (two > 0)
            {
                two -= 1;
            }
            else
            {
                sum += 2;
            }
        }
    }
    cout << sum << endl;

    return 0;
}